awscli
azure-cli
docker
dos2unix
duck
fzf
git
gradle
groovysdk
jemalloc
jq
kubernetes-cli
libev
mas
maven
mvndaemon/mvnd/mvnd
node
p7zip
php
plantuml
protobuf
pyenv
python
terminal-notifier
trash
vault
watch
wget
yarn
