awscli
bash
bash-completion
bash-git-prompt
brew-cask-completion
dos2unix
git
go
gradle
groovysdk
jq
jvmtop
mas
maven
p7zip
plantuml
protobuf
sonarqube
terminal-notifier
trash
wget
