1password
adobe-connect
adobe-creative-cloud
alfred
bbedit
chromium
cryptr
cyberduck
docker
drawio
dropbox
firefox
google-chrome
istat-menus
homebrew/cask-versions/iterm2-beta
homebrew/cask-drivers/jabra-direct
jd-gui
jetbrains-toolbox
lens
logitech-firmwareupdatetool
logitech-g-hub
logitech-options
p4v
path-finder
postman
signal
skype
slack-beta
spotify
visualvm
vmware-fusion
whatsapp
