1password
adobe-creative-cloud
alfred
bbedit
blue-jeans
chromium
cryptr
docker
dropbox
firefox
font-hack-nerd-font
google-chrome
istat-menus
iterm2-beta
java
java11
java8
jd-gui
jetbrains-toolbox
p4v
path-finder
postman
signal
silverlight
skype
slack-beta
spotify
visualvm
whatsapp
