awscli
azure-cli
bash
composer
docker
dos2unix
duck
fzf
git
gradle
groovysdk
jq
kubernetes-cli
mas
maven
p7zip
plantuml
protobuf
python@3.8
terminal-notifier
trash
vault
watch
wget
