1password
adobe-creative-cloud
alfred
bbedit
caffeine
chromium
cryptr
cyberduck
discord
docker
drawio
dropbox
elgato-control-center
firefox
font-hack-nerd-font
google-chrome
istat-menus
iterm2-beta
java
jd-gui
jetbrains-toolbox
kitematic
lens
logitech-firmwareupdatetool
logitech-g-hub
logitech-options
p4v
path-finder
postman
signal
skype
slack-beta
spotify
steam
vmware-fusion
whatsapp
zulu
zulu11
zulu8
